In [15]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [16]:
from glob import glob
all_dfs = glob('*.csv')
print(len(all_dfs))

6

In [17]:
import glob

all_dfs = []

for one_filename in glob.glob('??STHPI.csv'):
    one_df = pd.read_csv(one_filename, names=['date', 'price'], 
                         header=0,
                        parse_dates=['date'])
    one_df['location'] = one_filename[-11:-9]
    all_dfs.append(one_df)

In [18]:
len(all_dfs)

6

In [19]:
type(all_dfs)

list

In [20]:
type(all_dfs[0])

pandas.core.frame.DataFrame

In [21]:
df = pd.concat(all_dfs).set_index(['date', 'location']).sort_index()

In [22]:
len(df)

1158

In [23]:
df['price'].max()

951.26

In [24]:
df.loc[df['price'] == df['price'].max()]

                      price
date       location
2022-07-01 NY        951.26

This is faster:

In [25]:
df['price'].idxmax()

(Timestamp('2022-07-01 00:00:00'), 'NY')

In [26]:
type(df['price'].idxmax())

tuple

In [27]:
type(df.loc[df['price'] == df['price'].max()])

pandas.core.frame.DataFrame

In [28]:
pd.Timestamp('now') - df['price'].idxmax()[0]

Timedelta('383 days 17:56:21.266929')

In [29]:
df.index[-1][0]

Timestamp('2023-01-01 00:00:00')

In [30]:
df.loc[df.index[-1][0]]

           price
location
CA        891.69
CO        812.49
FL        766.75
HI        876.92
MI        477.03
NY        946.32

In [31]:
df.loc[df.index[-1][0], 'price'].idxmax()

'NY'

In [32]:
df.groupby(level='location')['price'].agg(['mean','median'])

                mean  median
location
CA        332.970104  235.46
CO        274.028446  230.82
FL        252.956891  190.80
HI        325.520777  262.75
MI        214.134922  227.52
NY        396.655492  310.02

In [33]:
df.xs('NY', level='location')

             price
date
1975-01-01   78.45
1975-04-01   75.77
1975-07-01   77.75
1975-10-01   79.61
1976-01-01   73.08
...            ...
2022-01-01  877.77
2022-04-01  929.97
2022-07-01  951.26
2022-10-01  946.79
2023-01-01  946.32

[193 rows x 1 columns]

In [34]:
df.xs('NY', level='location')['price'].mean()

396.65549222797927

In [35]:
df.xs((slice('2000','2020'), 'NY'), level=['date','location'])['price'].mean()

570.2147619047619

In [36]:
from pandas import IndexSlice as idx
idx['2000':'2020', ['CA','NY']]

(slice('2000', '2020', None), ['CA', 'NY'])

In [37]:
df.loc[idx['2000':'2020', ['CA','NY']],:]

                      price
date       location
2000-01-01 CA        261.03
           NY        335.61
2000-04-01 CA        268.06
           NY        345.65
2000-07-01 CA        277.05
...                     ...
2020-04-01 NY        723.32
2020-07-01 CA        685.69
           NY        735.16
2020-10-01 CA        699.83
           NY        751.13

[168 rows x 1 columns]

In [38]:
df.loc[idx['2000':'2020', ['CA','NY']],:].groupby('location')

In [39]:
df.loc[idx['2000':'2020', ['CA','NY']],:].groupby('location').mean()

               price
location
CA        489.775714
NY        570.214762

In [40]:
df.loc['2020':, 'price']

date        location
2020-01-01  CA          670.09
            CO          591.61
            FL          486.41
            HI          643.44
            MI          354.98
                         ...
2023-01-01  CO          812.49
            FL          766.75
            HI          876.92
            MI          477.03
            NY          946.32
Name: price, Length: 78, dtype: float64

In [41]:
df.loc['2020':, 'price'].groupby(level='location').pct_change()

date        location
2020-01-01  CA               NaN
            CO               NaN
            FL               NaN
            HI               NaN
            MI               NaN
                          ...
2023-01-01  CO          0.001603
            FL          0.000196
            HI         -0.022102
            MI          0.005607
            NY         -0.000496
Name: price, Length: 78, dtype: float64

In [42]:
df.loc['2020':, 'price'].groupby(level='location').pct_change(periods=11)

date        location
2020-01-01  CA               NaN
            CO               NaN
            FL               NaN
            HI               NaN
            MI               NaN
                          ...
2023-01-01  CO          0.357317
            FL          0.556474
            HI          0.345630
            MI          0.329812
            NY          0.308301
Name: price, Length: 78, dtype: float64

In [43]:
for ob in df.loc['2020':, 'price'].groupby(level='location').pct_change(periods=11):
    print(ob)

nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
nan
0.33786506290199814
0.37115667416034226
0.5760366768775314
0.39366529901777936
0.33632880725674674
0.3197886754579162
0.31562329403780054
0.3573170731707316
0.5564735495919775
0.34562975693591946
0.3298115521855485
0.30830061383619967

In [44]:
df.loc['2020':, 'price'].groupby(level='location').pct_change(periods=11).tail(6).sort_values()

date        location
2023-01-01  NY          0.308301
            CA          0.315623
            MI          0.329812
            HI          0.345630
            CO          0.357317
            FL          0.556474
Name: price, dtype: float64